In [6]:
import pandas as pd
import numpy as np
from utils import get_movie, get_movie_id, get_movie_data
import requests
from datetime import datetime

In [19]:
class MovieTable(pd.DataFrame):
    
    @classmethod
    def load_file(cls, filename):
        df = pd.read_csv(filename)
        if len(df.columns) > 2:
            raise Exception("The DataFrame must have two columns")
        else:
            return cls(df)
            return print(df)
    
    @classmethod
    def single_movie(cls, movie, year):
        data = [[movie, year]]
        df = pd.DataFrame(data, columns = ['movie', 'year'])
        return cls(df)
        return print(df)
        
    def _constructor(self, *args, **kwargs):
        pd.DataFrame._constructor(self, *args, **kwargs)
        self.created_at = datetime.today()
  
    @property
    def get_id_column(self):
        columns = self.columns
        iterator = zip(self[columns[0]], self[columns[1]])
        self["id"] = [get_movie_id(x[0], x[1]) for x in iterator]
        return self
    
    @property
    def add_new_column(self):
       
        # Get column to require   
        column = str(input("Enter column name: "))
        
        self[column] = [get_movie_data(x, column) for x in self["id"]]
    
        return self
    
    @property
    def flat_column(self):
        
        column = str(input("Enter column to flat: "))
        
        i = 0

        genres_list = []

        for row in self[column]:
            row_genres = []
            for genre in row:
                row_genres.append(genre["name"])
            genres_list.append(row_genres)
            i += 1
    
        self[column + "_1"] = [row[0] for row in genres_list]
        
        column_2 = []
        
        for row in genres_list:
            try:
                column_2.append(row[1])
            except:
                column_2.append(None)
                
        self[column + "_2"] = column_2      
        
        self.drop(columns = column, axis = 1, inplace = True)
        
        return self

In [20]:
ldf = MovieTable({"col1": [1,2], "col2": [3,4]})

In [21]:
ldf

   col1  col2
0     1     3
1     2     4

In [22]:
ldf.created_at

AttributeError: 'MovieTable' object has no attribute 'created_at'

In [23]:
df = MovieTable.load_file("Cartel1.csv")

df

          movie  year
0  The Irishman  2019
1          Okja  2017

In [94]:
df.get_id_column

          movie  year      id
0  The Irishman  2019  398978
1          Okja  2017  387426

In [95]:
df.add_new_column

Enter column name: runtime

          movie  year      id  runtime
0  The Irishman  2019  398978      209
1          Okja  2017  387426      122

In [96]:
df.add_new_column

Enter column name: genres

,movie,year,id,runtime,genres
0,The Irishman,2019,398978,209,"[{'id': 80, 'name': 'Crime'}, {'id': 18, 'name..."
1,Okja,2017,387426,122,"[{'id': 12, 'name': 'Adventure'}, {'id': 18, '..."

In [97]:
df.flat_column

Enter column to flat: genres

          movie  year      id  runtime   genres_1 genres_2
0  The Irishman  2019  398978      209      Crime    Drama
1          Okja  2017  387426      122  Adventure    Drama

In [98]:
df.add_new_column

Enter column name: imdb_id

          movie  year      id  runtime   genres_1 genres_2    imdb_id
0  The Irishman  2019  398978      209      Crime    Drama  tt1302006
1          Okja  2017  387426      122  Adventure    Drama  tt3967856

In [99]:
df.add_new_column

Enter column name: production_countries

,movie,year,id,runtime,genres_1,genres_2,imdb_id,production_countries
0,The Irishman,2019,398978,209,Crime,Drama,tt1302006,"[{'iso_3166_1': 'US', 'name': 'United States o..."
1,Okja,2017,387426,122,Adventure,Drama,tt3967856,"[{'iso_3166_1': 'KR', 'name': 'South Korea'}, ..."

In [100]:
df.flat_column

Enter column to flat: production_countries

,movie,year,id,runtime,genres_1,genres_2,imdb_id,production_countries_1,production_countries_2
0,The Irishman,2019,398978,209,Crime,Drama,tt1302006,United States of America,None
1,Okja,2017,387426,122,Adventure,Drama,tt3967856,South Korea,United States of America

In [82]:
for row in df["production_countries"]:
    print(row)

[{'iso_3166_1': 'US', 'name': 'United States of America'}]
[{'iso_3166_1': 'KR', 'name': 'South Korea'}, {'iso_3166_1': 'US', 'name': 'United States of America'}]